/** Напиши скрипт підрахунку сумми покупки зі скидкою в залежності
 *  від потраченої сумми за весь час (партнерська програма).
 *
 * - Загальна сума потраченого зберігається в змінній totalSpent
 * - Сумма поточного платежу зберігається змінній payment
 * - Скидка зберігається в змінній discount
 *
 * Якщо потрачено від 100 до 1000 - бронзовий партнер - скидка 2%
 * Якщо потрачено від 1000 до 5000 - срібний партнер - скидка 5%
 * Якщо потрачено більше 5000 - золотий партнер - скидка 10%
 * Якщо потрачено менше 100 - не партнер - скидка 0%
 *
 * В результаті вивести повідомлення
 *  "Оформляємо замовлення на сумму (сумма) зі скидкою (скидка)%"
 *  */

let totalSpent = 900;
let payment = 500;
let discount = 0;

if (totalSpent >= 100 && totalSpent < 1000) {
  console.log(`Бронзовий партнер, скидка 2%`);
  discount = 0.02;
} else if (totalSpent >= 1000 && totalSpent < 5000) {
  console.log(`Срібний партнер, скидка 5%`);
  discount = 0.05;
} else if (totalSpent >= 5000) {
  console.log(`Золотий партнер, скидка 10%`);
  discount = 0.1;
} else {
  console.log(`Не партнер, скидка 0%`);
  discount = 0;
}

payment -= payment * discount;
// payment = payment - payment * discount;

console.log(
  `Оформляємо замовлення на сумму ${payment} зі скидкою ${discount * 100}%`
);

totalSpent += payment;
console.log(`Загальна сума потраченого в магазині ${totalSpent}`);
